'''
Chapter : 1 - item : 3 - Election
โรงเรียนดังประจำจังหวัดแห่งหนึ่ง จะมีการจัดการเลือกตั้งหาประธานนักเรียนคนใหม่ขึ้นในทุกๆปี โดยในปีนี้มีผู้เข้าแข่งขันสูงถึง 20 คน 
โดยกฤษฎาได้รับมอบหมายให้เป็นผู้นับคะแนนเลือกตั้งในปีนี้ แต่กฤษฎารู้สึกขี้เกียจนับคะแนนขึ้นมา 
จึงได้ไหว้วานให้คุณช่วยเขียนโปรแกรม ในการหาว่าผู้เข้าแข่งขันคนใดได้รับคะแนนสูงที่สุด

ข้อควรระวัง หากมีการเลือกเลขที่ไม่ตรงกับผู้เข้าแข่งขัน (1-20) จะนับว่าเป็นบัตรเสีย และถ้าหากทุกใบเป็นบัตรเสียจะถือว่าไม่มีผู้ชนะ
'''
if __name__ == "__main__":
    print("*** Election ***")
    inp = int(input("Enter a number of voter(s) : "))
    voters = [int(n) for n in input().split()]
    candidate = 0
    MAX = 0
    for i in range(20):
        if voters.count(i) > MAX and i > 0:
            MAX = voters.count(i)
            candidate = i
    if candidate == 0 :  
        print("*** No Candidate Wins ***")
    else:
        print(candidate)